app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT * FROM "recipes"

  def show
  @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = '--- :id

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)

  def create
    @recipe = Recipe.create(params[:recipe])
---
INSERT INTO "recipes" ("created_at", "title", "method", "updated_at") VALUES('2011-12-08 15:57:01', 'Burger', 'Buy Burger', '2011-12-08 15:57:01')

  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.save
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 3)
UPDATE "recipes" SET "updated_at" = '2011-12-15 14:34:05', "method" = 'Buy Burger, eat much' WHERE "id" = 7

  def destroy
      @recipe = Recipe.find(params[:id])
      @recipe.delete
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 8)
DELETE FROM "recipes" WHERE ("id" IN (8))